public_html/Books Review/Cracking the Coding Interview/Cracking the Coding Interview 4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cracking the Coding Interview Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Cracking the Coding Interview Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-29T00:48+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Cracking the Coding Interview Notes</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Site</a></li>
<li><a href="#sec-2">Before the Interview</a>
<ul>
<li><a href="#sec-2-1">What questions should you ask the interviewer?</a></li>
</ul>
</li>
<li><a href="#sec-3">The Interview and Beyond</a>
<ul>
<li><a href="#sec-3-1">Five Steps to a Technical Questions</a></li>
<li><a href="#sec-3-2">Step 1: Ask Questions</a></li>
<li><a href="#sec-3-3">Step 2: Design an Algorithm</a></li>
<li><a href="#sec-3-4">Step 3: Pseudo-Code</a></li>
<li><a href="#sec-3-5">Step 4: Code</a></li>
<li><a href="#sec-3-6">Step 5: Test</a></li>
<li><a href="#sec-3-7">Five Algorithm Approaches</a></li>
</ul>
</li>
<li><a href="#sec-4">Questions</a>
<ul>
<li><a href="#sec-4-1">Chapter 7</a></li>
<li><a href="#sec-4-2">Chapter 8</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Site</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://www.careercup.com/">http://www.careercup.com/</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Before the Interview</h2>
<div class="outline-text-2" id="text-2">


<p>
Resume screeners look for the same things that interviewers do:
»»Are you smart?
»»Can you code?
</p>
<p>
Writing Strong Bullets: For each role, try to discuss your accomplishments with the following approach: “Accomplished X by implementing Y which led to Z.” Here’s an example:
</p>
<p>
»»“Reduced object rendering time by 75% by applying Floyd’s algorithm, leading to a 10% reduction in system boot time.”
Here’s another example with an alternate wording:
</p>
<p>
»»“Increased average match accuracy from 1.2 to 1.5 by implementing a
new comparison algorithm based on windiff.”
</p>
<p>
Languages: Knowing which languages to list on your resume is always a tricky thing. Do you list everything you’ve ever worked with? Or only the ones that you’re more comfortable with (even though that might only be one or two languages)? I recommend the following compromise: list most languages you’ve used, but add your experience level. This approach is shown below:
</p>
<p>
»»“Languages: Java (expert), C++ (proficient), JavaScript (prior
experience), C (prior experience)”
</p>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">What questions should you ask the interviewer?</h3>
<div class="outline-text-3" id="text-2-1">

<p>Most interviewers will give you a chance to ask them questions. The quality of your questions will be a factor, whether subconsciously or consciously, in their decisions.
Some questions may come to you during the interview, but you can - and should - prepare questions in advance. Doing research on the company or team may help you with preparing questions.
Questions can be divided into three different categories:
</p>
<p>
Genuine Questions: These are the questions you actually want to know. Here are a few ideas of questions that are valuable to many candidates:
</p>
<ol>
<li>“How much of your day do you spend coding?”
</li>
<li>“How many meetings do you have every week?”
</li>
<li>“What is the ratio of testers to developers to product managers? What is the interaction like? How does project planning happen on the team?”
</li>
</ol>


<p>
Insightful Questions: These questions are designed to demonstrate your deep knowledge of programming or technologies.
</p><ol>
<li>“I noticed that you use technology X. How do you handle problem Y?”
</li>
<li>“Why did the product choose to use the X protocol over the Y protocol? I know it has benefits like A, B, C, but many companies choose not to use it because of issue D.”
</li>
</ol>


<p>
Passion Questions: These questions are designed to demonstrate your passion for technology.
</p><ol>
<li>“I’m very interested in scalability. Did you come in with a background in this, or what opportunities are there to learn about it?”
</li>
<li>“I’m not familiar with technology X, but it sounds like a very interesting solution. Could you tell me a bit more about how it works?”
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Interview and Beyond</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Five Steps to a Technical Questions</h3>
<div class="outline-text-3" id="text-3-1">

<p>A technical interview question can be solved utilizing a five step approach:
</p><ol>
<li>Ask your interviewer questions to resolve ambiguity.
</li>
<li>Design an Algorithm
</li>
<li>Write pseudo-code first, but make sure to tell your interviewer that you’re writing pseudo-code! Otherwise, he/she may think that you’re never planning to write “real” code, and many interviewers will hold that against you.
</li>
<li>Write your code, not too slow and not too fast.
</li>
<li>Test your code and carefully fix any mistakes.
</li>
</ol>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Step 1: Ask Questions</h3>
<div class="outline-text-3" id="text-3-2">

<p>Good questions might be things like: What are the data types? How much data is there? What assumptions do you need to solve the problem? Who is the user?
Example: “Design an algorithm to sort a list.”
»»Question: What sort of list? An array? A linked list?
»»Answer: An array.
»»Question: What does the array hold? Numbers? Characters? Strings?
»»Answer: Numbers.
»Question: And are the numbers integers?
»»Answer: Yes.
»»Question: Where did the numbers come from? Are they IDs? Values of something?
»»Answer: They are the ages of customers.
»»Question: And how many customers are there?
»»Answer: About a million.
We now have a pretty different problem: sort an array containing a
million integers between 0 and 130. How do we solve this? Just create
an array with 130 elements and count the number of ages at each value.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Step 2: Design an Algorithm</h3>
<div class="outline-text-3" id="text-3-3">

<p>Designing an algorithm can be tough, but our five approaches to algorithms can help you out (see pg 34). While you’re designing your algorithm, don’t forget to think about:
»»What are the space and time complexities?
»»What happens if there is a lot of data?
»»Does your design cause other issues? (i.e., if you’re creating a modified version of a binary search tree, did your design impact the time for insert / find / delete?)
»»If there are other issues, did you make the right trade-offs?
»»If they gave you specific data (e.g., mentioned that the data is
ages, or in sorted order), have you leveraged that information?
There’s probably a reason that you’re given it.
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Step 3: Pseudo-Code</h3>
<div class="outline-text-3" id="text-3-4">

<p>Writing pseudo-code first can help you outline your thoughts clearly
and reduce the number of mistakes you commit. But, make sure to tell
your interviewer that you’re writing pseudo-code first and that you’ll
follow it up with “real” code. Many candidates will write pseudo-code
in order to ‘escape’ writing real code, and you certainly don’t want
to be confused with those candidates.
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Step 4: Code</h3>
<div class="outline-text-3" id="text-3-5">

<p>You don’t need to rush through your code; in fact, this will most likely hurt you. Just go at a nice, slow methodical pace. Also, remember this advice:
»»Use Data Structures Generously: Where relevant, use a good data
structure or define your own. For example, if you’re asked a problem
involving finding the minimum age for a group of people, consider
defining a data structure to represent a Person. This shows your interviewer that you care about good object oriented design.
</p>
<p>
»»Don’t Crowd Your Coding: This is a minor thing, but it can really
help. When you’re writing code on a whiteboard, start in the upper
left hand corner – not in the middle. This will give you plenty of
space to write your answer.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Step 5: Test</h3>
<div class="outline-text-3" id="text-3-6">

<p>Yes, you need to test your code! Consider testing for:
»»Extreme cases: 0, negative, null, maximums, etc
»»User error: What happens if the user passes in null or a negative value?
»»General cases: Test the normal case.
If the algorithm is complicated or highly numerical (bit shifting, arithmetic, etc), consider testing while you’re writing the code rather than just at the end.
Also, when you find mistakes (which you will), carefully think through
why the bug is occuring. One of the worst things I saw while
interviewing was candidates who recognized a mistake and tried making
“random” changes to fix the error.
</p>







</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Five Algorithm Approaches</h3>
<div class="outline-text-3" id="text-3-7">

<ul>
<li id="sec-3-7-1">APPROACH I: EXAMPLIFY<br/>
Description: Write out specific examples of the problem, and see if
you can figure out a general rule.
</li>
</ul>
<ul>
<li id="sec-3-7-2">APPROACH II: PATTERN MATCHING<br/>
Description: Consider what problems the algorithm is similar to, and
figure out if you can modify the solution to develop an algorithm for
this problem.
</li>
</ul>
<ul>
<li id="sec-3-7-3">APPROACH III: SIMPLIFY &amp; GENERALIZE<br/>
Description: Change a constraint (data type, size, etc) to simplify
the problem. Then try to solve it. Once you have an algorithm for the
“simplified” problem, generalize the problem again.
</li>
</ul>
<ul>
<li id="sec-3-7-4">APPROACH IV: BASE CASE AND BUILD<br/>
Description: Solve the algorithm first for a base case (e.g., just one
element). Then, try to solve it for elements one and two, assuming
that you have the answer for element one. Then, try to solve it for
elements one, two and three, assuming that you have the answer to
elements one and two.
</li>
</ul>
<ul>
<li id="sec-3-7-5">APPROACH V: DATA STRUCTURE BRAINSTORM<br/>
Description: This is hacky, but it often works. Simply run through a list of data structures and try to apply each one.
Example: Numbers are randomly generated and stored into an (expanding) array. How would you keep track of the median?
Data Structure Brainstorm:
»»Linked list? Probably not – linked lists tend not to do very well with accessing and sorting numbers.
»»Array? Maybe, but you already have an array. Could you somehow keep the elements sorted? That’s probably expensive. Let’s hold off on this and return to it if it’s needed.
»»Binary tree? This is possible, since binary trees do fairly well with ordering. In fact, if the binary search tree is perfectly balanced, the top might be the median. But, be careful – if there’s an even number of elements, the median is actually the average of the middle two elements. The middle two elements can’t both be at the top. This is probably a workable algorithm, but let’s come back to it.
»»Heap? A heap is really good at basic ordering and keeping track of max and mins. This is actually interesting – if you had two heaps, you could keep track of the biggest half and the smallest half of the elements. The biggest half is kept in a min heap, such that the smallest element in the biggest half is at the root. The smallest half is kept in a max heap, such that the biggest element of the smallest half is at the root. Now, with these data structures, you have the potential median elements at the roots. If the heaps are no longer the same size, you can quickly “rebalance” the heaps by popping an element off the one heap and pushing it onto the other.
Note that the more problems you do, the better instinct you will
develop about which data structure to apply.


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Questions</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Chapter 7</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li id="sec-4-1-1">7.9<br/>
data block allocation -&gt; “Practical File System Design” or B+ trees
</li>
</ul>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Chapter 8</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li id="sec-4-2-1">8.1 Fibonacci number<br/>
you may read about the (most efficient) matrix-based algorithm at <a href="http://en.wikipedia.org/wiki/Fibonacci_number#Matrix_form">http://en.wikipedia.org/wiki/Fibonacci_number#Matrix_form</a>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-29T00:48+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
